# Database

In [2]:
import sqlite3

In [3]:
ab=sqlite3.connect("python.db")

In [ ]:
'''CREATE TABLE table_name (
    column1 datatype,
    column2 datatype,
    column3 datatype,
   ....
);'''

In [4]:
ab.execute('''create table employee(emp_id int primary key,name text,age int,gender text)''')

In [ ]:
'''INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);'''

In [5]:
ab.execute("insert into employee values(120,'Aman',24,'Male')")

In [6]:
ab.execute("insert into employee values(121,'Rahul',23,'Male')")

In [7]:
ab.execute("insert into employee values(122,'Ankita',22,'Female')")

In [9]:
ab.execute("insert into employee values(123,'Rohit',29,'Male')")

In [10]:
ab.execute("insert into employee values(124,'Riya',27,'Female')")

In [ ]:
'''SELECT column1, column2, ...
FROM table_name;'''

In [ ]:
'''SELECT * FROM table_name;'''

In [21]:
a=ab.execute("select * from employee")

In [22]:
for i in a:
    print(i)

(120, 'Aman', 24, 'Male')
(121, 'Rahul', 23, 'Male')
(122, 'Ankita', 34, 'Female')
(123, 'Rohit', 29, 'Male')

In [13]:
for i in ab.execute("select * from employee"):
    print("Id :- ",i[0])
    print("Name :- ",i[1])
    print("Age :- ",i[2])
    print("Gender :- ",i[3])

Id :-  120
Name :-  Aman
Age :-  24
Gender :-  Male
Id :-  121
Name :-  Rahul
Age :-  23
Gender :-  Male
Id :-  122
Name :-  Ankita
Age :-  22
Gender :-  Female
Id :-  123
Name :-  Rohit
Age :-  29
Gender :-  Male
Id :-  124
Name :-  Riya
Age :-  27
Gender :-  Female

In [14]:
for i in ab.execute("select * from employee"):
    print(i)

(120, 'Aman', 24, 'Male')
(121, 'Rahul', 23, 'Male')
(122, 'Ankita', 22, 'Female')
(123, 'Rohit', 29, 'Male')
(124, 'Riya', 27, 'Female')

In [15]:
#update value

In [ ]:
'''UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;'''

In [16]:
ab.execute("update employee set age=34 where emp_id=122")

In [17]:
for i in ab.execute("select * from employee"):
    print(i)

(120, 'Aman', 24, 'Male')
(121, 'Rahul', 23, 'Male')
(122, 'Ankita', 34, 'Female')
(123, 'Rohit', 29, 'Male')
(124, 'Riya', 27, 'Female')

In [18]:
#delete

In [ ]:
'''DELETE FROM table_name WHERE condition;'''

In [19]:
ab.execute("delete from employee where emp_id=124")

In [20]:
for i in ab.execute("select * from employee"):
    print(i)

(120, 'Aman', 24, 'Male')
(121, 'Rahul', 23, 'Male')
(122, 'Ankita', 34, 'Female')
(123, 'Rohit', 29, 'Male')

In [ ]:
ab.commit()